20260320T222157--kdoc-557-unionはselectしたフィールドでないとorder-byできない__permanent.org
:properties:
:ID: 20260320T222157
:end:
#+title:      KDOC 557: UNIONはSELECTしたフィールドでないとORDER BYできない
#+date:       [2026-03-20 Fri 22:21]
#+filetags:   :permanent:
#+identifier: 20260320T222157

* この文書のステータス
- 作成
  - [X] 2026-05-12 貴島
- レビュー
  - [X] 2026-05-13 貴島

* 概要
:PROPERTIES:
  :header-args+: :results table
  :header-args+: :database postgres
  :header-args+: :dbhost localhost
  :header-args+: :dbport 15432
  :header-args+: :dbuser postgres
  :header-args+: :engine postgresql
:END:

JOINはSELECTしてなくてもORDER BYできる。

#+begin_src sql
  CREATE TABLE products (
    id    INT PRIMARY KEY,
    name  TEXT,
    price INT
  );

  CREATE TABLE reviews (
    id         INT PRIMARY KEY,
    product_id INT REFERENCES products(id),
    score      INT,
    created_at DATE
  );

  INSERT INTO products VALUES
    (1, 'Widget', 500),
    (2, 'Gadget', 1200),
    (3, 'Gizmo',  800);

  INSERT INTO reviews VALUES
    (1, 1, 4, '2026-01-10'),
    (2, 2, 5, '2026-02-15'),
    (3, 3, 3, '2026-03-01');

  -- JOINではSELECTしていないカラムでORDER BYできる
  -- reviews.created_at はSELECTにないが、JOINの結果テーブルに存在するのでORDER BYできる
  SELECT p.name, r.score
  FROM products p
  JOIN reviews r ON p.id = r.product_id
  ORDER BY r.created_at;
#+end_src

#+RESULTS:
#+begin_src
|                                             |       |
|---------------------------------------------+-------|
| > CREATE TABLE products (                   |       |
| >   id    INT PRIMARY KEY,                  |       |
| >   name  TEXT,                             |       |
| >   price INT                               |       |
| > );                                        |       |
| CREATE TABLE                                |       |
|                                             |       |
| > CREATE TABLE reviews (                    |       |
| >   id         INT PRIMARY KEY,             |       |
| >   product_id INT REFERENCES products(id), |       |
| >   score      INT,                         |       |
| >   created_at DATE                         |       |
| > );                                        |       |
| CREATE TABLE                                |       |
|                                             |       |
| > INSERT INTO products VALUES               |       |
| >   (1, 'Widget', 500),                     |       |
| >   (2, 'Gadget', 1200),                    |       |
| >   (3, 'Gizmo',  800);                     |       |
| INSERT 0 3                                  |       |
|                                             |       |
| > INSERT INTO reviews VALUES                |       |
| >   (1, 1, 4, '2026-01-10'),                |       |
| >   (2, 2, 5, '2026-02-15'),                |       |
| >   (3, 3, 3, '2026-03-01');                |       |
| INSERT 0 3                                  |       |
|                                             |       |
| > SELECT p.name, r.score                    |       |
| > FROM products p                           |       |
| > JOIN reviews r ON p.id = r.product_id     |       |
| > ORDER BY r.created_at;                    |       |
| name                                        | score |
| Widget                                      |     4 |
| Gadget                                      |     5 |
| Gizmo                                       |     3 |
#+end_src

UNIONではSELECTしたカラムでしかORDER BYできない。

#+begin_src sql
  CREATE TABLE products (
    id    INT PRIMARY KEY,
    name  TEXT,
    price INT
  );

  CREATE TABLE reviews (
    id         INT PRIMARY KEY,
    product_id INT REFERENCES products(id),
    score      INT,
    created_at DATE
  );

  INSERT INTO products VALUES
    (1, 'Widget', 500),
    (2, 'Gadget', 1200),
    (3, 'Gizmo',  800);

  INSERT INTO reviews VALUES
    (1, 1, 4, '2026-01-10'),
    (2, 2, 5, '2026-02-15'),
    (3, 3, 3, '2026-03-01');

  -- OK: name はSELECTされたカラムなのでORDER BYできる
  SELECT name, price FROM products WHERE price >= 1000
  UNION ALL
  SELECT name, price FROM products WHERE price < 1000
  ORDER BY name;

  -- エラー: id はSELECTされていないのでORDER BYできない。column "id" not found になる
  SELECT name, price FROM products WHERE price >= 1000
  UNION ALL
  SELECT name, price FROM products WHERE price < 1000
  ORDER BY id;
#+end_src

#+caption: ERROR:  column "id" does not exist。結果にidフィールドはないため
#+RESULTS:
#+begin_src
|                                                        |       |
|--------------------------------------------------------+-------|
| > CREATE TABLE products (                              |       |
| >   id    INT PRIMARY KEY,                             |       |
| >   name  TEXT,                                        |       |
| >   price INT                                          |       |
| > );                                                   |       |
| CREATE TABLE                                           |       |
|                                                        |       |
| > CREATE TABLE reviews (                               |       |
| >   id         INT PRIMARY KEY,                        |       |
| >   product_id INT REFERENCES products(id),            |       |
| >   score      INT,                                    |       |
| >   created_at DATE                                    |       |
| > );                                                   |       |
| CREATE TABLE                                           |       |
|                                                        |       |
| > INSERT INTO products VALUES                          |       |
| >   (1, 'Widget', 500),                                |       |
| >   (2, 'Gadget', 1200),                               |       |
| >   (3, 'Gizmo',  800);                                |       |
| INSERT 0 3                                             |       |
|                                                        |       |
| > INSERT INTO reviews VALUES                           |       |
| >   (1, 1, 4, '2026-01-10'),                           |       |
| >   (2, 2, 5, '2026-02-15'),                           |       |
| >   (3, 3, 3, '2026-03-01');                           |       |
| INSERT 0 3                                             |       |
|                                                        |       |
| > SELECT name, price FROM products WHERE price >= 1000 |       |
| > UNION ALL                                            |       |
| > SELECT name, price FROM products WHERE price < 1000  |       |
| > ORDER BY name;                                       |       |
| name                                                   | price |
| Gadget                                                 |  1200 |
| Gizmo                                                  |   800 |
| Widget                                                 |   500 |
|                                                        |       |
| > SELECT name, price FROM products WHERE price >= 1000 |       |
| > UNION ALL                                            |       |
| > SELECT name, price FROM products WHERE price < 1000  |       |
| > ORDER BY id;                                         |       |
#+end_src

JOINは行を横に結合するので元テーブルの全カラムが結果に残る。UNIONは行を縦に積むのでSELECTしたカラムだけが結果に残る。

* 関連

なし。
