20260320T222157--kdoc-557-unionはselectしたフィールドでないとorder-byできない__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-05-23T22:32:27Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 557: UNIONはSELECTしたフィールドでないとORDER BYできない</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 557: UNIONはSELECTしたフィールドでないとORDER BYできない</h1>
<div id="outline-container-org86583d4" class="outline-2">
<h2 id="org86583d4"><a href="#org86583d4">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org86583d4">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-05-12 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-05-13 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd65e42f" class="outline-2">
<h2 id="orgd65e42f"><a href="#orgd65e42f">概要</a></h2>
<div class="outline-text-2" id="text-orgd65e42f">
<p>
JOINはSELECTしてなくてもORDER BYできる。
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">CREATE</span> <span class="org-keyword">TABLE</span> <span class="org-function-name">products</span> (
  id    <span class="org-type">INT</span> <span class="org-keyword">PRIMARY</span> <span class="org-keyword">KEY</span>,
  <span class="org-keyword">name</span>  TEXT,
  price <span class="org-type">INT</span>
);

<span class="org-keyword">CREATE</span> <span class="org-keyword">TABLE</span> <span class="org-function-name">reviews</span> (
  id         <span class="org-type">INT</span> <span class="org-keyword">PRIMARY</span> <span class="org-keyword">KEY</span>,
  product_id <span class="org-type">INT</span> <span class="org-keyword">REFERENCES</span> products(id),
  score      <span class="org-type">INT</span>,
  created_at <span class="org-type">DATE</span>
);

<span class="org-keyword">INSERT</span> <span class="org-keyword">INTO</span> products <span class="org-keyword">VALUES</span>
  (1, <span class="org-string">'Widget'</span>, 500),
  (2, <span class="org-string">'Gadget'</span>, 1200),
  (3, <span class="org-string">'Gizmo'</span>,  800);

<span class="org-keyword">INSERT</span> <span class="org-keyword">INTO</span> reviews <span class="org-keyword">VALUES</span>
  (1, 1, 4, <span class="org-string">'2026-01-10'</span>),
  (2, 2, 5, <span class="org-string">'2026-02-15'</span>),
  (3, 3, 3, <span class="org-string">'2026-03-01'</span>);

<span class="org-comment-delimiter">-- </span><span class="org-comment">JOIN&#12391;&#12399;SELECT&#12375;&#12390;&#12356;&#12394;&#12356;&#12459;&#12521;&#12512;&#12391;ORDER BY&#12391;&#12365;&#12427;
</span><span class="org-comment-delimiter">-- </span><span class="org-comment">reviews.created_at &#12399;SELECT&#12395;&#12394;&#12356;&#12364;&#12289;JOIN&#12398;&#32080;&#26524;&#12486;&#12540;&#12502;&#12523;&#12395;&#23384;&#22312;&#12377;&#12427;&#12398;&#12391;ORDER BY&#12391;&#12365;&#12427;
</span><span class="org-keyword">SELECT</span> p.<span class="org-keyword">name</span>, r.score
<span class="org-keyword">FROM</span> products p
<span class="org-keyword">JOIN</span> reviews r <span class="org-keyword">ON</span> p.id = r.product_id
<span class="org-keyword">ORDER</span> <span class="org-keyword">BY</span> r.created_at;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">|                                             |       |
|---------------------------------------------+-------|
| &gt; CREATE TABLE products (                   |       |
| &gt;   id    INT PRIMARY KEY,                  |       |
| &gt;   name  TEXT,                             |       |
| &gt;   price INT                               |       |
| &gt; );                                        |       |
| CREATE TABLE                                |       |
|                                             |       |
| &gt; CREATE TABLE reviews (                    |       |
| &gt;   id         INT PRIMARY KEY,             |       |
| &gt;   product_id INT REFERENCES products(id), |       |
| &gt;   score      INT,                         |       |
| &gt;   created_at DATE                         |       |
| &gt; );                                        |       |
| CREATE TABLE                                |       |
|                                             |       |
| &gt; INSERT INTO products VALUES               |       |
| &gt;   (1, 'Widget', 500),                     |       |
| &gt;   (2, 'Gadget', 1200),                    |       |
| &gt;   (3, 'Gizmo',  800);                     |       |
| INSERT 0 3                                  |       |
|                                             |       |
| &gt; INSERT INTO reviews VALUES                |       |
| &gt;   (1, 1, 4, '2026-01-10'),                |       |
| &gt;   (2, 2, 5, '2026-02-15'),                |       |
| &gt;   (3, 3, 3, '2026-03-01');                |       |
| INSERT 0 3                                  |       |
|                                             |       |
| &gt; SELECT p.name, r.score                    |       |
| &gt; FROM products p                           |       |
| &gt; JOIN reviews r ON p.id = r.product_id     |       |
| &gt; ORDER BY r.created_at;                    |       |
| name                                        | score |
| Widget                                      |     4 |
| Gadget                                      |     5 |
| Gizmo                                       |     3 |
</pre>
</div>

<p>
UNIONではSELECTしたカラムでしかORDER BYできない。
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">CREATE</span> <span class="org-keyword">TABLE</span> <span class="org-function-name">products</span> (
  id    <span class="org-type">INT</span> <span class="org-keyword">PRIMARY</span> <span class="org-keyword">KEY</span>,
  <span class="org-keyword">name</span>  TEXT,
  price <span class="org-type">INT</span>
);

<span class="org-keyword">CREATE</span> <span class="org-keyword">TABLE</span> <span class="org-function-name">reviews</span> (
  id         <span class="org-type">INT</span> <span class="org-keyword">PRIMARY</span> <span class="org-keyword">KEY</span>,
  product_id <span class="org-type">INT</span> <span class="org-keyword">REFERENCES</span> products(id),
  score      <span class="org-type">INT</span>,
  created_at <span class="org-type">DATE</span>
);

<span class="org-keyword">INSERT</span> <span class="org-keyword">INTO</span> products <span class="org-keyword">VALUES</span>
  (1, <span class="org-string">'Widget'</span>, 500),
  (2, <span class="org-string">'Gadget'</span>, 1200),
  (3, <span class="org-string">'Gizmo'</span>,  800);

<span class="org-keyword">INSERT</span> <span class="org-keyword">INTO</span> reviews <span class="org-keyword">VALUES</span>
  (1, 1, 4, <span class="org-string">'2026-01-10'</span>),
  (2, 2, 5, <span class="org-string">'2026-02-15'</span>),
  (3, 3, 3, <span class="org-string">'2026-03-01'</span>);

<span class="org-comment-delimiter">-- </span><span class="org-comment">OK: name &#12399;SELECT&#12373;&#12428;&#12383;&#12459;&#12521;&#12512;&#12394;&#12398;&#12391;ORDER BY&#12391;&#12365;&#12427;
</span><span class="org-keyword">SELECT</span> <span class="org-keyword">name</span>, price <span class="org-keyword">FROM</span> products <span class="org-keyword">WHERE</span> price &gt;= 1000
<span class="org-keyword">UNION</span> <span class="org-keyword">ALL</span>
<span class="org-keyword">SELECT</span> <span class="org-keyword">name</span>, price <span class="org-keyword">FROM</span> products <span class="org-keyword">WHERE</span> price &lt; 1000
<span class="org-keyword">ORDER</span> <span class="org-keyword">BY</span> <span class="org-keyword">name</span>;

<span class="org-comment-delimiter">-- </span><span class="org-comment">&#12456;&#12521;&#12540;: id &#12399;SELECT&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12398;&#12391;ORDER BY&#12391;&#12365;&#12394;&#12356;&#12290;column "id" not found &#12395;&#12394;&#12427;
</span><span class="org-keyword">SELECT</span> <span class="org-keyword">name</span>, price <span class="org-keyword">FROM</span> products <span class="org-keyword">WHERE</span> price &gt;= 1000
<span class="org-keyword">UNION</span> <span class="org-keyword">ALL</span>
<span class="org-keyword">SELECT</span> <span class="org-keyword">name</span>, price <span class="org-keyword">FROM</span> products <span class="org-keyword">WHERE</span> price &lt; 1000
<span class="org-keyword">ORDER</span> <span class="org-keyword">BY</span> id;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>ERROR:  column &ldquo;id&rdquo; does not exist。結果にidフィールドはないため</label><pre class="src src-nil">|                                                        |       |
|--------------------------------------------------------+-------|
| &gt; CREATE TABLE products (                              |       |
| &gt;   id    INT PRIMARY KEY,                             |       |
| &gt;   name  TEXT,                                        |       |
| &gt;   price INT                                          |       |
| &gt; );                                                   |       |
| CREATE TABLE                                           |       |
|                                                        |       |
| &gt; CREATE TABLE reviews (                               |       |
| &gt;   id         INT PRIMARY KEY,                        |       |
| &gt;   product_id INT REFERENCES products(id),            |       |
| &gt;   score      INT,                                    |       |
| &gt;   created_at DATE                                    |       |
| &gt; );                                                   |       |
| CREATE TABLE                                           |       |
|                                                        |       |
| &gt; INSERT INTO products VALUES                          |       |
| &gt;   (1, 'Widget', 500),                                |       |
| &gt;   (2, 'Gadget', 1200),                               |       |
| &gt;   (3, 'Gizmo',  800);                                |       |
| INSERT 0 3                                             |       |
|                                                        |       |
| &gt; INSERT INTO reviews VALUES                           |       |
| &gt;   (1, 1, 4, '2026-01-10'),                           |       |
| &gt;   (2, 2, 5, '2026-02-15'),                           |       |
| &gt;   (3, 3, 3, '2026-03-01');                           |       |
| INSERT 0 3                                             |       |
|                                                        |       |
| &gt; SELECT name, price FROM products WHERE price &gt;= 1000 |       |
| &gt; UNION ALL                                            |       |
| &gt; SELECT name, price FROM products WHERE price &lt; 1000  |       |
| &gt; ORDER BY name;                                       |       |
| name                                                   | price |
| Gadget                                                 |  1200 |
| Gizmo                                                  |   800 |
| Widget                                                 |   500 |
|                                                        |       |
| &gt; SELECT name, price FROM products WHERE price &gt;= 1000 |       |
| &gt; UNION ALL                                            |       |
| &gt; SELECT name, price FROM products WHERE price &lt; 1000  |       |
| &gt; ORDER BY id;                                         |       |
</pre>
</div>

<p>
JOINは行を横に結合するので元テーブルの全カラムが結果に残る。UNIONは行を縦に積むのでSELECTしたカラムだけが結果に残る。
</p>
</div>
</div>
<div id="outline-container-orgb3bfd77" class="outline-2">
<h2 id="orgb3bfd77"><a href="#orgb3bfd77">関連</a></h2>
<div class="outline-text-2" id="text-orgb3bfd77">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
